#+begin_src C :results output :tangle r.c
  #include <stdio.h>

  int main() 
  {
    /* Demo for printf
       ----------------*/
  // declare and assign value
  int length = 10;
  float flength = 11;
  int A = length * length;

  // print integer variable
   printf("%d\n",length);
   printf("length: %d\n",length); 
   printf("A: %d\n",A); 

   // print floating-point variable
   // with accuracy 4 after the decimal point
   printf("length: %.4f",flength); 
   return 0;
  }
#+end_src

#+RESULTS:
: 10
: length: 10
: A: 100
: length: 11.0000
